1.指定與重設
  (1)一個整數指定
  (2)tuple 或 list 指定
  (3)重設陣列
2.重設新陣列
  (1)resize 這個動作會依據原本的陣列再設定指定大小的新陣列。
  (2)resize 動作的參數如下:
          numpy.resize(arr1，shape1)
          arr1:原本的陣列
          shape1:新規劃的大小
  (3)如果規劃的新陣列比較大，將會重新複製原有陣列的資料，填滿新的儲存格。

  (4)resize 這個動作建立新的陣列，而 reshape 則是依據原有的重新規劃，仍會受到原有陣列影響。
  
  a = np.arange(12)
  
>>>  [ 0  1  2  3  4  5  6  7  8  9 10 11]
  
  b = a.reshape((3,4))
  
>>> [[ 0  1  2  3]
     [ 4  5  6  7]
     [ 8  9 10 11]]  
     
  d = a.reshape((3,4),order = 'F')  #Fortran

>>> [[ 0  3  6  9]
     [ 1  4  7 10]
     [ 2  5  8 11]]
     
  e = a.reshape((2,6))
>>> [[ 0  1  2  3  4  5]
     [ 6  7  8  9 10 11]]
     
  a.reshape((1,2,6))

>>> [ [[ 0  1  2  3  4  5]
       [ 6  7  8  9 10 11]] ]

  a.reshape((1,2,1,6))
>>> [[ [[ 0  1  2  3  4  5]]
       [[ 6  7  8  9 10 11]] ]]
       
  a.reshape((1,2,1,6,1))
  
>>> [[[[[ 0]
    [ 1]
    [ 2]
    [ 3]
    [ 4]
    [ 5]]]
    
    [[[ 6]
    [ 7]
    [ 8]
    [ 9]
    [10]
    [11]]]]]
